[M_Orchid_Wingman MissionDefinition]
MissionDescription="Shade wants to propose to a woman named Natalie. Unfortunately, he's lost the engagement ring. If you can find the ring and propose to Natalie on Shade's behalf, you'll have made him the happiest insane quasi-necrophiliac on Pandora."
TurnInDescription="Natalie turned Shade down, thankfully ensuring that the two will never share a honeymoon."
MissionSummary="Help Shade propose to Natalie."
